# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [8]:
series1 = pd.Series(np.random.randint(1, 5, 100, 'l'))
series2 = pd.Series(np.random.randint(1, 4, 100, 'l'))
series3 = pd.Series(np.random.randint(10000, 30001, 100, 'l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.concat([series1, series2, series3], axis=1)
df.sample()
df.shape

(100, 3)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.sample()

    0  1      2
31  1  1  16391

In [16]:
df = df.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'})
df.sample()

    bedrs  bathrs  price_sqr_meter
52      1       2            24986

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.concat([series1, series2, series3])
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       3
2       2
3       3
4       2
..    ...
95  24583
96  27156
97  21074
98  24719
99  17648

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [26]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
bigcolumn.reset_index(drop=True, inplace=True)

In [28]:
bigcolumn

         0
0        3
1        3
2        2
3        3
4        2
..     ...
295  24583
296  27156
297  21074
298  24719
299  17648

[300 rows x 1 columns]